from telegram.ext import ConversationHandler


# other commands

def start(update, context):
    update.message.reply_text(
        'Віаємо! Цей телеграм-бот розроблений, аби вирішити проблему транспортного сполучення для медиків під час '
        'пандемії COVID-19.\n\nКоротка інструкція з користування:\nДля реєстрації у системі оберіть команду /register. '
        'Після проходження реєстрації Ви можете скористатися цією ж командою, аби видалити свої дані з системи.\n\n'
        'Далі Ви можете додати маршрут вашої поїздки до системи. Для цього оберіть команду /add_ride. Уважно слідкуйте '
        'за інструкціями, що будуть надіслані вам у повідомленнях, система чутлива до форматування.\n\n'
        'Після того, як Ви створили маршрут, ми перевіримо чи не має поряд з місцем вашого відправлення користувачів '
        'з протилежним типом профілю. Якщо такі знайдуться — ми надішлемо водію інформацію щодо маршруту медика, '
        'та відправимо медику повідомлення.\n\nВ процесі проходження реєстрації, або створення нового маршруту, '
        'Ви можте відмінити ваші дії обравши команду /cancel.')


def cancel(update, context):
    return ConversationHandler.END



# Віаємо! Цей телеграм-бот розроблений, аби вирішити проблему транспортного сполучення для медиків під час
# пандемії COVID-19.\n\nКоротка інструкція з користування\nДля реєстрації у системі оберіть команду /register.
# Підля проходження реєстрації Ви можете скористатися цією ж командою, аби видалити свої дані з системи.
# Далі Ви можете додати маршрут вашої поїздки до системи. Для цього оберіть команду /add_ride. Уважно слідкуйте
# за інструкціями, що будуть надіслані вам у повідомленнях, система чутлива до форматування.\n\n
# Після того, як Ви створили маршрут, ми перевіримо чи не має поряд з місцем вашого відправлення медиків.
# Якщо такі знайдуться — ми повідомимо Вам про це, та надішлемо інформацію про їх маршрут та контакти.
# Перевірте місце їх призначення, та візміть медика з собою, якщо Вам по дорозі!\n\nВ процесі проходження
# реєстрації, або створення нового маршруту, Ви можте відмінити ваші дії обравши команду /cancel.